---
kind: property
id: P:Autodesk.Revit.DB.Group.GroupType
source: html/d77ac466-dc1f-90cb-0b5f-d23fe88065d6.htm
---
# Autodesk.Revit.DB.Group.GroupType Property

Get or set the type of the group.

## Syntax (C#)
```csharp
public virtual GroupType GroupType { get; set; }
```

## Remarks
By setting this property the group can be swapped to a different kind of group.